% 2x = 4 の解を計算
a = [2];
b = [4];
ans1 = a \ b; % 2

% 2x + 3y = 9 の解を計算
c = [2 3];
d = [9];
ans2 = c \ d; % [0; 3]

% 2x + 2y = 4 の解を計算
e = [2 2];
f = [4];
ans3 = e \ f; % [2; 0] ... 最初に見つけた解を返す？

% 次の連立方程式の解を計算
%     1. 2x + y = 1
%     2. x + 2y = 8
g = [2 1; 1 2];
h = [1; 8];
ans4 = g \ h; % [-2; 5]

% ■ 手計算
% 3. 「 1.」より y を求める
% y = 1 - 2x
%
% 4. 「3.」の結果を「2.」に代入して x を求める
% x + 2(1 - 2x) = 8
% x + 2 - 4x = 8
% -3x + 2 = 8
% -3x = 6
% x = -2
% 
% 5. 「4.」の結果を「1.」に代入して y を求める
% 2(-2) + y = 1
% -4 + y = 1
% y = 5

